#ifndef MOUDLEDATS_H
#define MOUDLEDATS_H

#define MOUDLE_NUM  		22	  //模块总数

#define MOUDLE_ID			22   //选择编译模块

#define MOUDLE_DEBUG		1

/**********************************************************************
1.	4x4矩阵键盘
2.	RFID
3.	语音
4.	传感器模拟
5.	光照强度
6.	CO2含量
7.	红外热释电
8.	雨水检测
9.	温湿度
10.大气压强

11.风速传感器
12.双色点阵
13.4.3寸触摸LCD
14.土壤湿度检测
15.电动窗帘控制
16.喷雾控制
17.排风控制
18.空气加热控制
19.生长灯控制
20.电源自动切换控制

**********************************************************************/

typedef void funMoudle(void);

#endif
